ExprovipFuel/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыПрописи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ExprovipFuel/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКЕвро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКДоллару</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Catalogs/Валюты/ManagerModule.bsl
// Получить сруктуру курса.
// 
// Параметры:
//  Валюта - СправочникСсылка.Валюты
//  ДатаКурса - Дата
// 
// Возвращаемое значение:
//  Структура - Получить сруктуру курса:
// * Курс - Число - 
// * Кратность - Число - 
// * КурсВзаиморасчетов - Число - 
// * КурсКЕвро - Число - 
// * КурсКДоллару - Число - 
Функция ПолучитьСруктуруКурса(Валюта, ДатаКурса) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Курс", 0);
	Структура.Вставить("Кратность", 0);
	Структура.Вставить("КурсВзаиморасчетов", 0);
	Структура.Вставить("КурсКЕвро", 0);
	Структура.Вставить("КурсКДоллару", 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаКурса);
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность,
	|	КурсыВалютСрезПоследних.КурсВзаиморасчетов,
	|	КурсыВалютСрезПоследних.КурсКЕвро,
	|	КурсыВалютСрезПоследних.КурсКДоллару
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;

КонецФункции
